---
kind: property
id: P:Autodesk.Revit.DB.Visual.UnifiedBitmap.TextureScaleLock
source: html/4ea03509-9ed3-63f2-6994-13e82d10a279.htm
---
# Autodesk.Revit.DB.Visual.UnifiedBitmap.TextureScaleLock Property

The property labeled "Scale Lock" from the "UnifiedBitmap" schema.

## Syntax (C#)
```csharp
public static string TextureScaleLock { get; }
```

## Remarks
This property is of type "AssetPropertyBoolean".